Repository: ThinkInAIXYZ/clawdhome
Catalog: ClawdHome/Stable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

# binding.account
source: 账号
en: Account
zh_hant: 帳號

# binding.account_section
source: IM 账号
en: IM Account
zh_hant: IM 帳號

# binding.any_account
source: 通配（所有账号）
en: Wildcard (All Accounts)
zh_hant: 萬用（所有帳號）

# binding.hint.channel
source: Slack：以 C 开头的 channel ID；Discord：channel snowflake ID
en: Slack: channel ID starting with C; Discord: channel snowflake ID
zh_hant: Slack：以 C 開頭的 channel ID；Discord：channel snowflake ID

# binding.hint.direct
source: 飞书：open_id（前缀 `ou_`）；微信：wxid 或 @username
en: Feishu: open_id (prefix `ou_`); WeChat: wxid or @username
zh_hant: 飛書：open_id（前綴 `ou_`）；微信：wxid 或 @username

# binding.hint.group
source: 飞书：chat_id（前缀 `oc_`）；微信：群聊 chatroom_id（`@chatroom`）
en: Feishu: chat_id (prefix `oc_`); WeChat: group chatroom_id (`@chatroom`)
zh_hant: 飛書：chat_id（前綴 `oc_`）；微信：群聊 chatroom_id（`@chatroom`）

# binding.peer_section
source: 路由到（可选）
en: Route To (Optional)
zh_hant: 路由到（可選）

# binding.peer_type
source: 类型
en: Type
zh_hant: 類型

# binding.title
source: 配置绑定
en: Configure Binding
zh_hant: 設定綁定

# browser.account.status.invalid_user
source: 用户不存在或用户名无效
en: User does not exist or username is invalid
zh_hant: 使用者不存在或使用者名稱無效

# browser.account.status.not_opened
source: 浏览器账号尚未打开
en: Browser account has not been opened yet
zh_hant: 瀏覽器帳號尚未開啟

# browser.account.status.running
source: 浏览器账号运行中
en: Browser account is running
zh_hant: 瀏覽器帳號執行中

# browser.account.status.unreachable
source: 浏览器账号已存在，但 Chrome 无法连接
en: Browser account exists, but Chrome is unreachable
zh_hant: 瀏覽器帳號已存在，但 Chrome 無法連線

# browser.tool.error.opencli_profile_unavailable
source: 无法获取 OpenCLI Browser Bridge 配置目录
en: Unable to obtain OpenCLI Browser Bridge profile
zh_hant: 無法取得 OpenCLI Browser Bridge 設定檔目錄

# common.action.clear_screen
source: 清屏
en: Clear Screen

# common.action.clone_terminal
source: 复制终端
en: Common Action Clone Terminal

# common.action.export_output
source: 导出输出…
en: Common Action Export Output

# common.add
source: 添加
en: Common Add

# common.body
source: 正文
en: Common Body

# common.cancel
source: 取消
en: Cancel

# common.clear
source: 清空
en: Common Clear

# common.close
source: 关闭
en: Common Close

# common.confirm
source: 确认
en: Common Confirm

# common.copied
source: 已复制
en: Copied
zh_hant: 已複製

# common.copy
source: 复制
en: Common Copy

# common.create
source: 新增
en: Common Create

# common.delete
source: 删除
en: Common Delete

# common.done
source: 完成
en: Done

# common.edit
source: 编辑
en: Edit
zh_hant: 編輯

# common.ok
source: 好
en: Common Ok

# common.remove
source: 移除
en: Common Remove

# common.sort
source: 排序
en: Common Sort

# common.status
source: 状态
en: Common Status

# common.status.installed
source: 已安装
en: Common Status Installed

# common.title
source: 标题
en: Common Title

# common.unknown_error
source: 未知错误
en: Unknown error
zh_hant: 未知錯誤

# content_view.nav.prompts
source: 提示词
en: Prompt
zh_hant: 提示詞

# content_view.theme.dark
source: 深色模式
en: Content View Theme Dark

# content_view.theme.light
source: 浅色模式
en: Content View Theme Light

# content_view.theme.system
source: 跟随系统
en: Content View Theme System

# hermes.pending_bindings.empty_desc
source: 所有扫码平台均已配对完成
en: Hermes Pending Bindings Empty Description

# hermes.pending_bindings.empty_title
source: 没有待完成的绑定
en: Hermes Pending Bindings Empty Title

# hermes.setup.installed_hint
source: Hermes Agent 已安装。
en: Hermes Setup Installed Hint

# im_accounts.add
source: 添加 Bot 账号
en: IM Accounts Add

# im_accounts.delete_confirm_detail
source: 将移除 \(a.displayName)（\(a.platform.displayName)）
en: \(a.displayName)(\(a.platform.displayName))

# im_accounts.delete_confirm_title
source: 确认移除
en: IM Accounts Delete Confirm Title

# im_accounts.empty
source: 暂无 IM 账号，点击 + 添加
en: IM Accounts Empty

# model.config.current_fallback
source: 当前为备用模型
en: Model Config Current Fallback

# model.config.current_primary
source: 当前为主模型
en: Model Config Current Primary

# model.config.no_matching_models
source: 无匹配模型
en: Model Config No Matching Models

# model.config.set_as_primary
source: 设为主模型
en: Model Config Set As Primary

# model.exec.configure_provider
source: 配置 %@ 凭据
en: Configure %@ credentials

# model.exec.demote_to_fallback
source: 将 %@ 设为备用
en: Set %@ as fallback

# model.exec.set_primary
source: 设置主模型：%@
en: Model Exec Set Primary %@

# model_picker.clear_invalid
source: 清除失效选择，回到继承默认
en: Model Picker Clear Invalid

# model_picker.empty
source: 模型池为空，请先去「模型」tab 添加
en: Model Picker Empty

# model_picker.inherit.unset
source: 继承全局默认（未设置）
en: Model Picker Inherit Unset

# model_picker.inherit.with_value
source: 继承全局默认（%@）
en: Inherit global default (%@)

# models.llm_manager.empty.add_model_desc
source: 点击「添加模型」，选择 Provider 并一次勾选多个模型。
en: Models Llm Manager Empty Add Model Description

source: 挂起运行时相关进程，可恢复继续执行（不释放内存）
en: Models Managed User Suspend Runtime Processes Resume Later Without Releasing Memory

# models.managed_user.userprocess_runtime_priority
source: 紧急终止用户空间进程（运行时相关优先）
en: Models Managed User Userprocess Runtime Priority

# prompt.filter.all
source: 全部 Prompt
en: Prompt Filter All

# prompt.filter.recent
source: 最近使用
en: Prompt Filter Recent

# prompt.filter.unused
source: 未使用
en: Prompt Filter Unused

# prompt.library.all_results
source: 全部结果
en: Prompt Library All Results

# prompt.library.basic_info
source: 基本信息
en: Prompt Library Basic Info

# prompt.library.detail.empty
source: 填写标题、标签和正文后保存到库中。
en: Prompt Library Detail Empty

# prompt.library.edit_prompt
source: 编辑 Prompt
en: Prompt Library Edit Prompt

# prompt.library.enable_prompt
source: 启用此 Prompt
en: Prompt Library Enable Prompt

# prompt.library.nav_title
source: 提示词
en: Prompt
zh_hant: 提示詞

# prompt.library.never_used
source: 尚未使用
en: Prompt Library Never Used

# prompt.library.new_prompt
source: 新建 Prompt
en: Prompt Library New Prompt

# prompt.library.no_match
source: 没有匹配的 Prompt
en: Prompt Library No Match

# prompt.library.no_match.hint
source: 换一个关键词，或者在右侧新建一条 Prompt。
en: Prompt Library No Match Hint

# prompt.library.pinned
source: 置顶
en: Prompt Library Pinned

# prompt.library.result.search
source: 搜索到 %@ 条匹配结果
en: %@ matching results

# prompt.library.result.total
source: 共 %@ 条
en: %@ total

# prompt.library.section.browse
source: 浏览
en: Prompt Library Section Browse

# prompt.library.section.tags
source: 标签
en: Prompt Library Section Tags

# prompt.library.settings
source: 库设置
en: Prompt Library Settings

# prompt.library.source.from_input
source: 来自输入
en: Prompt Library Source From Input

# prompt.library.source.imported
source: 导入
en: Prompt Library Source Imported

# prompt.library.source.manual
source: 手动创建
en: Prompt Library Source Manual

# prompt.library.stats.pinned
source: 置顶
en: Prompt Library Stats Pinned

# prompt.library.stats.recent
source: 最近使用
en: Prompt Library Stats Recent

# prompt.library.stats.total
source: 总数
en: Prompt Library Stats Total

# prompt.library.title
source: Prompt 管理
en: Prompt Library Title

# prompt.memory.append
source: 追加
en: Prompt Memory Append

# prompt.memory.create_prompt
source: 新增 Prompt
en: Prompt Memory Create Prompt

# prompt.memory.default_insert
source: 默认插入
en: Prompt Memory Default Insert

# prompt.memory.empty
source: 暂无收藏
en: Prompt Memory Empty

# prompt.memory.empty.hint
source: 可以先收藏当前输入，或到 Prompt 管理页新建。
en: Prompt Memory Empty Hint

# prompt.memory.favorite
source: 收藏
en: Prompt Memory Favorite

# prompt.memory.favorite_current
source: 收藏当前输入
en: Prompt Memory Favorite Current

# prompt.memory.field.body
source: 正文
en: Prompt Memory Field Body

# prompt.memory.field.keywords
source: 关键词
en: Prompt Memory Field Keywords

# prompt.memory.field.summary
source: 摘要
en: Prompt Memory Field Summary

# prompt.memory.field.tags
source: 标签
en: Prompt Memory Field Tags

# prompt.memory.field.title
source: 标题
en: Prompt Memory Field Title

# prompt.memory.fill_variables
source: 填充变量
en: Prompt Memory Fill Variables

# prompt.memory.match_field
source: 匹配 %@
en: Matched %@

# prompt.memory.note.autosave
source: Markdown 自动保存
en: Prompt Memory Note Autosave

# prompt.memory.note.empty
source: 暂无内容
en: Prompt Memory Note Empty

# prompt.memory.note.placeholder
source: 支持 Markdown，输入时直接渲染。
en: Prompt Memory Note Placeholder

# prompt.memory.note.saved_auto
source: 已自动保存
en: Prompt Memory Note Saved Auto

# prompt.memory.pin_panel
source: 固定面板
en: Prompt Memory Pin Panel

# prompt.memory.replace
source: 替换
en: Prompt Memory Replace

# prompt.memory.replace.confirm.message
source: 当前输入框内容会被选中的 Prompt 替换。
en: Prompt Memory Replace Confirm Message

# prompt.memory.replace.confirm.title
source: 替换当前输入？
en: Prompt Memory Replace Confirm Title

# prompt.memory.reusable
source: 可复用
en: Prompt Memory Reusable

# prompt.memory.search.placeholder
source: 搜索标题、标签、关键词或正文
en: Prompt Memory Search Placeholder

# prompt.memory.similar_hint
source: 相似提醒
en: Prompt Memory Similar Hint

# prompt.memory.tags.placeholder
source: 标签/关键词，用逗号分隔
en: Prompt Memory Tags Placeholder

# prompt.memory.unpin_panel
source: 取消固定
en: Prompt Memory Unpin Panel

# prompt.memory.use_count
source: 用
en: Prompt Memory Use Count

# prompt.sort.most_used
source: 常用
en: Prompt Sort Most Used

# prompt.sort.recent
source: 最近
en: Prompt Sort Recent

# prompt.sort.smart
source: 推荐
en: Prompt Sort Smart

# prompt.sort.title
source: 标题
en: Prompt Sort Title

# services.model_ping_service.hello_prompt
source: 请发送你好
en: Services Model Ping Service Hello Prompt

# shrimp.settings.dependency.bridge.update_available
source: 已安装（%@），可升级到 %@
en: Installed (%@), upgrade available: %@

# user.detail.channel.manage
source: 管理
en: User Detail Channel Manage

# views.detail.config_source_existing
source: 已有配置
en: Existing

# views.detail.config_source_new
source: 新增配置
en: New

# views.detail.config_source_picker
source: 配置来源
en: Source

# views.detail.error_select_template
source: 请先选择配置和模型
en: Views Detail Error Select Template

# views.detail.error_template_no_key
source: 该账户未存储 API Key，请切换到新增配置手动输入
en: Views Detail Error Template No Key

# views.detail.global_pool_sync_confirm
source: 保存
en: Views Detail Global Pool Sync Confirm

# views.detail.global_pool_sync_dismiss
source: 不了
en: Views Detail Global Pool Sync Dismiss

# views.detail.global_pool_sync_prompt
source: 保存到全局模型池？
en: Views Detail Global Pool Sync Prompt

# views.detail.template_model_picker
source: 模型
en: Model

# views.detail.template_picker
source: 选择账户
en: Account

# views.detail.template_picker_placeholder
source: 请选择…
en: Choose…

# views.model_manager.llmmanager_tab.add_model
source: 添加模型
en: Views Model Manager Llmmanager Tab Add Model

# views.terminal_log.theme.black
source: 黑色
en: Black

# views.terminal_log.theme.system
source: 跟随系统
en: Follow System

# views.user_files_view.ascending
source: 升序
en: Views User Files View Ascending

# views.user_files_view.confirm_delete_multiple
source: 删除已选中的 %d 项？此操作不可撤销。
en: Delete selected %d items? This action cannot be undone.

# views.user_files_view.delete_count
source: 删除（%d）
en: Delete (%d)

# views.user_files_view.delete_partial_failed_count
source: %@；等 %@ 项删除失败
en: %@; %@ items failed to delete

# views.user_files_view.descending
source: 降序
en: Views User Files View Descending

# views.user_files_view.sort
source: 排序
en: Views User Files View Sort

# views.user_files_view.sort_by
source: 排序方式
en: Views User Files View Sort By

# views.user_list_view.userprocess_hermes_process_start
source: 将紧急终止该虾的用户空间进程（优先 Hermes 相关），已终止进程不可恢复，只能重新启动。
en: Views User List View Userprocess Hermes Process Start

# wizard.base_env.start_gateway
source: 启动网关
en: Start Gateway
zh_hant: 啟動網關

# wizard.hermes_env.exit_code
source: 最近退出码：%d
en: Latest exit code: %d
zh_hant: 最近結束碼：%d

# wizard.hermes_env.heading
source: 安装 Hermes 运行时
en: Install Hermes Runtime
zh_hant: 安裝 Hermes 執行環境

# wizard.hermes_env.install_btn
source: 安装 Hermes
en: Install Hermes
zh_hant: 安裝 Hermes

# wizard.hermes_env.ready
source: Hermes 运行时已就绪
en: Hermes Runtime Ready
zh_hant: Hermes 執行環境已就緒

# wizard.hermes_env.terminal_hint
source: 支持键盘输入，可在需要时手动干预。
en: Keyboard input is supported for manual intervention when needed.
zh_hant: 支援鍵盤輸入，可在需要時手動介入。

# wizard.hermes_env.terminal_placeholder
source: 点击“安装 Hermes”启动交互终端。
en: Click \"Install Hermes\" to start an interactive terminal.
zh_hant: 點擊「安裝 Hermes」啟動互動終端。

# wizard.hermes_env.terminal_title
source: 安装终端（交互式）
en: Install Terminal (Interactive)
zh_hant: 安裝終端（互動式）

# wizard.hermes_setup.done
source: 设置向导已完成
en: Setup wizard completed
zh_hant: 設定精靈已完成

# wizard.hermes_setup.exit_abnormal
source: 向导异常退出（代码 %d），你可以重新运行。
en: Wizard exited abnormally (code %d). You can run it again.
zh_hant: 精靈異常結束（代碼 %d），你可以重新執行。

# wizard.hermes_setup.exit_code
source: 退出码：%d
en: Exit code: %d
zh_hant: 結束碼：%d

# wizard.hermes_setup.heading
source: Hermes 设置
en: Hermes Setup
zh_hant: Hermes 設定

# wizard.hermes_setup.hint
source: 使用交互式 `hermes setup` 向导配置模型和 API Key。
en: Use the interactive `hermes setup` wizard to configure model and API key.
zh_hant: 使用互動式 `hermes setup` 精靈設定模型與 API Key。

# wizard.hermes_setup.keyboard_hint
source: 支持键盘输入，请按提示完成设置。
en: Keyboard input is supported. Follow prompts to finish setup.
zh_hant: 支援鍵盤輸入，請依提示完成設定。

# wizard.hermes_setup.rerun
source: 重新运行
en: Run Again
zh_hant: 重新執行

# wizard.maintenance.files
source: 文件
en: Files
zh_hant: 檔案

# wizard.maintenance.files.window_title
source: @%@ · 文件
en: @%@ · Files
zh_hant: @%@ · 檔案

# wizard.maintenance.processes
source: 进程
en: Processes
zh_hant: 行程

# wizard.maintenance.processes.window_title
source: @%@ · 进程
en: @%@ · Processes
zh_hant: @%@ · 行程

# wizard.maintenance.section_title
source: 维护工具
en: Maintenance Tools
zh_hant: 維護工具

# wizard.maintenance.terminal
source: 终端
en: Terminal
zh_hant: 終端

# wizard.model_config.existing_channel
source: 全局渠道
en: Channel

# wizard.model_config.existing_hint
source: 将复用该全局渠道的模型与凭据配置。
en: Wizard Model Config Existing Hint

# wizard.model_config.existing_missing_key
source: 所选已有配置未设置 API Key
en: Wizard Model Config Existing Missing Key

# wizard.model_config.existing_model
source: 模型
en: Model

# wizard.model_config.skip_step
source: 跳过
en: Wizard Model Config Skip Step

# wizard.model_config.source
source: 配置来源
en: Source

# wizard.model_config.source.existing
source: 已有配置
en: Existing

# wizard.model_config.source.new
source: 新增配置
en: New

# wizard_v2.agents.heading
source: Agent 模型绑定
en: Agent Model Binding
zh_hant: Agent 模型綁定

# wizard_v2.agents.hint
source: 可选：为每个 Agent 指定专用模型。留空则继承全局模型配置。
en: Optional: assign a dedicated model for each Agent. Leave empty to inherit global model config.
zh_hant: 可選：為每個 Agent 指定專用模型。留空則繼承全域模型設定。

# wizard_v2.agents.model_placeholder
source: 继承全局模型
en: Inherit Global Model
zh_hant: 繼承全域模型

# wizard_v2.agents.role_picker.title
source: 选择角色
en: Select Role
zh_hant: 選擇角色

# wizard_v2.basic_env.heading
source: 安装基础运行环境
en: Install Base Runtime Environment
zh_hant: 安裝基礎執行環境

# wizard_v2.basic_env.ready
source: 环境已就绪
en: Environment Ready
zh_hant: 環境已就緒

# wizard_v2.basic_env.reconnect_log
source: 重新连接日志
en: Reconnect Log
zh_hant: 重新連線日誌

# wizard_v2.basic_env.start
source: 开始安装
en: Start Installation
zh_hant: 開始安裝

# wizard_v2.basic_env.terminal_hint
source: 统一 SwiftTerm 显示（tail-log 模式）。
en: Unified SwiftTerm display (tail-log mode).
zh_hant: 統一 SwiftTerm 顯示（tail-log 模式）。

# wizard_v2.basic_env.terminal_title
source: 安装终端（日志跟踪）
en: Install Terminal (Log Tracking)
zh_hant: 安裝終端（日誌追蹤）

# wizard_v2.cancel_confirm.discard
source: 放弃
en: Discard
zh_hant: 放棄

# wizard_v2.cancel_confirm.message
source: 已配置的 Agent 和 IM 设置将不会保存。
en: Configured Agent and IM settings will not be saved.
zh_hant: 已設定的 Agent 與 IM 設定將不會儲存。

# wizard_v2.cancel_confirm.title
source: 放弃初始化？
en: Discard Initialization?
zh_hant: 放棄初始化？

# wizard_v2.done.elapsed
source: 耗时 %@
en: Elapsed %@
zh_hant: 耗時 %@

# wizard_v2.done.hermes_summary
source: Hermes 引擎初始化完成
en: Hermes engine initialization completed

# wizard_v2.done.saving
source: 正在写入配置...
en: Writing configuration...
zh_hant: 正在寫入設定...

# wizard_v2.done.success
source: 初始化完成！
en: Initialization Complete!

# wizard_v2.done.summary
source: %d 个 Agent，%d 个 IM Bot 绑定
en: %d Agents, %d IM Bot bindings
zh_hant: %d 個 Agent，%d 個 IM Bot 綁定

# wizard_v2.im.banner
source: 只绑定默认 Agent 即可。主 Agent 可将任务分派给其他 Agent，后续也可在设置中补绑或更新 IM。
en: Binding only the default Agent is enough. The main Agent can delegate tasks to other Agents, and you can bind/update IM later in settings.
zh_hant: 只綁定預設 Agent 即可。主 Agent 可將任務分派給其他 Agent，後續也可在設定中補綁或更新 IM。

# wizard_v2.im.heading
source: 绑定 IM Bot
en: Bind IM Bot
zh_hant: 綁定 IM Bot

# wizard_v2.im.hint
source: 可选：绑定并非主 Agent 任务分派的必需项
en: Optional — binding is not required for main Agent task dispatch
zh_hant: 可選：綁定並非主 Agent 任務分派的必要項

# wizard_v2.title_with_instance
source: 创建实例 %@@%@
en: Create Instance %@@%@
zh_hant: 建立實例 %@@%@

# host_permission.banner.title
source: 需要系统权限授权
en: Permission needed
zh_hant: 需要系統權限授權

# host_permission.banner.action.accessibility
source: 授权辅助功能
en: UI Access
zh_hant: 授權輔助功能

# host_permission.banner.action.chrome_automation
source: 授权 Chrome 自动化
en: Enable Chrome
zh_hant: 授權 Chrome 自動化

# host_permission.banner.action.open_settings
source: 打开系统设置
en: Open Settings
zh_hant: 打開系統設定

# host_permission.banner.action.refresh
source: 刷新
en: Refresh
zh_hant: 重新整理

# host_permission.banner.missing.accessibility
source: 辅助功能（UI 自动化）
en: Accessibility (UI automation)
zh_hant: 輔助功能（UI 自動化）

# host_permission.banner.missing.chrome_pending
source: Chrome 自动化（待同意）
en: Chrome automation (pending consent)
zh_hant: Chrome 自動化（待同意）

# host_permission.banner.missing.chrome_denied
source: Chrome 自动化（已拒绝）
en: Chrome automation (denied)
zh_hant: Chrome 自動化（已拒絕）

# host_permission.banner.missing.chrome_unavailable
source: Chrome 自动化（不可用）
en: Chrome automation (unavailable)
zh_hant: Chrome 自動化（不可用）

# host_permission.banner.summary.ready
source: 所有必需权限已就绪
en: All required permissions are ready
zh_hant: 所有必要權限已就緒

# host_permission.banner.summary.missing
source: 缺失权限：%@。授权后可自动执行浏览器相关操作。
en: Missing: %@. Grant access for browser automation.
zh_hant: 缺失權限：%@。授權後可自動執行瀏覽器相關操作。

# settings.permissions.section
source: 系统权限
en: System Permissions
zh_hant: 系統權限

# settings.permissions.accessibility
source: 辅助功能
en: Accessibility
zh_hant: 輔助功能

# settings.permissions.chrome_automation
source: Chrome 自动化
en: Chrome Automation
zh_hant: Chrome 自動化

# settings.permissions.chrome_not_installed
source: 未安装 Chrome
en: Chrome not installed
zh_hant: 未安裝 Chrome

# settings.permissions.action.accessibility
source: 授权辅助功能
en: Allow Accessibility
zh_hant: 授權輔助功能

# settings.permissions.action.chrome_automation
source: 授权 Chrome 自动化
en: Allow Chrome Automation
zh_hant: 授權 Chrome 自動化

# settings.permissions.action.refresh
source: 刷新权限状态
en: Refresh Permission Status
zh_hant: 重新整理權限狀態

# settings.permissions.hint
source: 用于浏览器自动化与授权回调。若缺失权限，相关功能会失败。
en: Used for browser automation and auth callbacks. Related features will fail if missing.
zh_hant: 用於瀏覽器自動化與授權回呼。若缺失權限，相關功能會失敗。

# settings.permissions.status.granted
source: 已授权
en: Granted
zh_hant: 已授權

# settings.permissions.status.pending
source: 待同意
en: Pending Consent

# settings.permissions.status.denied
source: 已拒绝
en: Denied
zh_hant: 已拒絕

# settings.permissions.status.unavailable
source: 不可用
en: Unavailable
